adt> adta -s jordan

adt> adtp
=== ADT (bst) ===
[  0] = jorda   

adt> adta -s jordano

adt> adtp
=== ADT (bst) ===
[  0] = jorda   [  1] = jorda   

adt> adta -s jorda

adt> adtp
=== ADT (bst) ===
[  0] = jorda   [  1] = jorda   [  2] = jorda   

adt> adta -s jordan

adt> adtp
=== ADT (bst) ===
[  0] = jorda   [  1] = jorda   [  2] = jorda   [  3] = jorda   


adt> adta -s jordana

adt> adtp
=== ADT (bst) ===
[  0] = jorda   [  1] = jorda   [  2] = jorda   [  3] = jorda   
[  4] = jorda   

adt> adtd -s jordani

adt> adtp
=== ADT (bst) ===
[  0] = jorda   [  1] = jorda   [  2] = jorda   [  3] = jorda   


adt> adtd -s jord

adt> adtp
=== ADT (bst) ===
[  0] = jorda   [  1] = jorda   [  2] = jorda   [  3] = jorda   


adt> adta -r 30

adt> adtp
=== ADT (bst) ===
[  0] = agdue   [  1] = bybne   [  2] = cdmtz   [  3] = fitho   
[  4] = gutrz   [  5] = gzxwg   [  6] = hgpgd   [  7] = hokex   
[  8] = ifxjr   [  9] = jbalb   [ 10] = jorda   [ 11] = jorda   
[ 12] = jorda   [ 13] = jorda   [ 14] = jvxby   [ 15] = kdczf   
[ 16] = mfyxd   [ 17] = mqjny   [ 18] = nblyy   [ 19] = ncerx   
[ 20] = nmzhu   [ 21] = nukxh   [ 22] = nvphq   [ 23] = ojtnr   
[ 24] = relwv   [ 25] = shtqj   [ 26] = tduet   [ 27] = uhlfe   
[ 28] = vkuux   [ 29] = wqlqh   [ 30] = xqsdp   [ 31] = ykvrx   
[ 32] = yprwl   [ 33] = yrjtj   

adt> adtd -front 5

adt> adtp
=== ADT (bst) ===
[  0] = gzxwg   [  1] = hgpgd   [  2] = hokex   [  3] = ifxjr   
[  4] = jbalb   [  5] = jorda   [  6] = jorda   [  7] = jorda   
[  8] = jorda   [  9] = jvxby   [ 10] = kdczf   [ 11] = mfyxd   
[ 12] = mqjny   [ 13] = nblyy   [ 14] = ncerx   [ 15] = nmzhu   
[ 16] = nukxh   [ 17] = nvphq   [ 18] = ojtnr   [ 19] = relwv   
[ 20] = shtqj   [ 21] = tduet   [ 22] = uhlfe   [ 23] = vkuux   
[ 24] = wqlqh   [ 25] = xqsdp   [ 26] = ykvrx   [ 27] = yprwl   
[ 28] = yrjtj   

adt> adtd -back 5

adt> adtp
=== ADT (bst) ===
[  0] = gzxwg   [  1] = hgpgd   [  2] = hokex   [  3] = ifxjr   
[  4] = jbalb   [  5] = jorda   [  6] = jorda   [  7] = jorda   
[  8] = jorda   [  9] = jvxby   [ 10] = kdczf   [ 11] = mfyxd   
[ 12] = mqjny   [ 13] = nblyy   [ 14] = ncerx   [ 15] = nmzhu   
[ 16] = nukxh   [ 17] = nvphq   [ 18] = ojtnr   [ 19] = relwv   
[ 20] = shtqj   [ 21] = tduet   [ 22] = uhlfe   [ 23] = vkuux   


adt> adtd -r 5

adt> adtp
=== ADT (bst) ===
[  0] = gzxwg   [  1] = hgpgd   [  2] = jbalb   [  3] = jorda   
[  4] = jorda   [  5] = jorda   [  6] = jorda   [  7] = jvxby   
[  8] = kdczf   [  9] = mfyxd   [ 10] = nblyy   [ 11] = ncerx   
[ 12] = nukxh   [ 13] = nvphq   [ 14] = relwv   [ 15] = shtqj   
[ 16] = tduet   [ 17] = uhlfe   [ 18] = vkuux   

adt> adtd -all

adt> adtp
=== ADT (bst) ===


adt> q -f

